DROP DATABASE movies;
CREATE DATABASE movies;
USE movie;

INSERT INTO  cinema(name_of_cinema, adress) 
VALUES ('Кіностудія', 'вул. Шептицьких, 26, Львів')
  -- ,('Космос', 'вул. Циганська, 12, Львів')
  ,('Кіностудія', 'вул. Чорновола, 30, Івано-Франківськ')
  ,('Кіностудія', 'вул. Мазепи, 45, Івано-Франківськ')
  ,('Кіностудія', 'вул. Пекарська, 27, Львів')
  ;

Insert into user ( first_name, last_name, email, age, phone_num) values
('Галина', 'Кілестин', 'galina.kilestun@gmail.com', 20, '380657315023');
Insert into user (first_name, last_name, email, age, phone_num) values
( 'Артур', 'Тихоступ', 'artur.tyhostyp@gmail.com', 31, '380694516523'),
('Олена', 'Дзюбанська', 'olena1607g@gmail.com', 24, '380975619852'),
('Андрій', 'Слабий', 'slabuya@gmail.com', 27, '380256475125'),
('Марія', 'Стрілець', 'maria_st@gmail.com', 19, '38097541659'),
('Михайло', 'Дмитрук', 'muhaylo_dmut@gmail.com', 36, '380965231789'),
('Вікторія', 'Федунь', 'fedyn123@gmail.com', 45, '380989653214'),
('Максим', 'Скорбач', 'skorbach987@gmail.com', 32, '380126547342'),
('Ольга', 'Завгородня', 'olha.zav5@gmail.com', 26, '38065362145'),
('Назар', 'Кутний', 'nazar4567@gmail.com', 21, '380652315042'),
('Анастасія', 'Жураковська', 'anastasia876@gmail.com', 22, '380231564785'),
('Віталій', 'Дубський','dubsikyi@gmail.com',19,'380965214652'),
('Влада', 'Стрілець','v_st3445@gmail.com',25,'380214516856'),
('Богдан', 'Вовсівськмй','vovkivsk_v@gmail.com',19,'380966690164'),
('Ірина', 'Кохан','kohan2345@gmail.com',33,'380123245689'),
('Роман', 'Саків','sakivrom@gmail.com',32,'380964578942'),
('Оксана', 'Моткалюк','oksans_m@gmail.com',41,'380612345698'),
('Софія', 'Струк','struks@gmail.com',20,'380214569862'),
('Олександр', 'Пипчак','olek_4567@gmail.com',29,'380264652134'),
('Наталя', 'Сухоребська','nat_such386g@gmail.com',45,'38036985214'),
('Соломія', 'Грисько','colomia_hrusko@gmail.com',42,'380264576012'),
('Назар', 'Лисий','lysyi895@gmail.com',26,'380965648210'),
('Марта', 'Грезда','m_hrezda@gmail.com',23,'380954675120'),
('Дарина', 'Ватуляк','vatuliak@gmail.com',23,'380978564236'),
('Ярина', 'Пастернак','pasternak_ia@gmail.com',34,'380231656485'),
('Артем', 'Бурко','busko_artem@gmail.com',30,'380956214560');

INSERT INTO  hall( num_of_seats_pr, num_of_seats_nr, cinema_id) 
VALUES ( 10 , 20, 1)
,( 20, 40, 1)
-- ,(10 , 22, 5)
-- ,(15, 40, 5)
,(10, 30, 4)
,(25, 55, 2)
-- ,(10, 20, 2)
-- ,(25, 42, 1)
-- ,( 15, 35, 3)
,(10, 20, 3)
;
 
 INSERT INTO movie ( m_name, m_language, genre, audience, cost_nr, m_time_min)
 VALUES
('Бетмен', 'Українська','Екшн/Пригоди', '16+', 250, 176),
( 'Бетмен',  'Англійська','Екшн/Пригоди', '16+', 250, 176),
('Гра тіней','Українська', 'Екшн/Детектив', '16+', 220, 108 ),
('Незвідане: Удача Дрейка', 'Українська','Пригоди/Екшин', '16+', 200, 116),
('Співай 2 ', 'Українська','Комедія/Мультимедія/Сімейний','0+', 220, 110),
('Падіння Місяця','Українська', 'Екшн/Пригоди','12+', 110, 120),
('Падіння Місяця','Англійська', 'Екшн/Пригоди','12+', 150, 120),
('Падіння Місяця','Французька', 'Екшн/Пригоди','12+', 150, 120),
('Мої думки тихі','Українська', 'Комедія','12+', 150, 104),
('Побачення в Парижі','Французька', 'Романтика/Комелія','16+', 170, 89),
('Побачення в Парижі','Українська', 'Романтика/Комелія','16+', 170, 89),
('Швидка','Англійська', 'Екшин/Кримінал','16+', 250, 137),
('Швидка','Українська', 'Екшин/Кримінал','16+', 220, 137),
('Історія моєї дружини','Українська', 'Романтика/Мелодрама','16+', 170, 169),
('Обігнати час','Українська', 'Екшин/Трилер','16+', 175, 85),
('Обігнати час','Англійська', 'Екшин/Трилер','16+',175, 85);

INSERT INTO showe ( show_time, show_date, seats_remaining_pr, seats_remaining_nr, hall_id, movie_id)
VALUES 
( '09:00' , '22-06-01', 10, 20, 1, 1),
('12:25', '22-06-01', 10, 20, 1, 3)
,('14:40', '22-06-01', 10, 20, 1, 5)
,('16:50', '22-06-01', 10, 20, 1, 7)
,('19:20', '22-06-01', 10, 20, 1 , 11)
,('21:10', '22-06-01', 10, 20, 1, 13)
,('09:00', '22-06-01', 10, 30, 3, 1)
,('12:25', '22-06-01', 10, 30, 3, 3)
,('14:40', '22-06-01', 10, 30, 3, 5);
INSERT INTO showe ( show_time, show_date, seats_remaining_pr, seats_remaining_nr, hall_id, movie_id)
VALUES 
('16:50', '22-06-01', 10, 30, 3, 7)
,('19:20', '22-06-01', 10, 30, 3, 11)
,('21:10', '22-06-01', 10, 30, 3, 13)
,('09:00', '22-06-01', 10, 20, 5, 1)
,('12:25', '22-06-01', 10, 20, 5, 3)
,('14:40', '22-06-01', 10, 20, 5, 5)
,('16:50', '22-06-01', 10, 20, 5, 7)
,('19:20', '22-06-01', 10, 20, 5, 11)
,('21:10', '22-06-01', 10, 20, 5, 13)
,('09:00', '22-06-02', 10, 20, 1, 6)
,('09:00', '22-06-02', 10, 20, 5, 6) 
,('09:00', '22-06-02', 10, 30, 3, 6)
,('09:00', '22-06-02', 10, 20, 3, 6)
;


INSERT INTO showe (show_time, show_date, seats_remaining_pr, seats_remaining_nr, hall_id, movie_id)
VALUES 
( '11:30', '22-06-02', 10, 20, 5, 5)
,( '13:50', '22-06-02', 10, 20, 1, 9)
,('13:50', '22-06-02', 10, 30, 3, 9)
,('13:50', '22-06-02', 10, 20, 5, 9)
,('16:00', '22-06-02', 10, 20, 1, 2)
,('16:00', '22-06-02', 10, 20, 5, 2)
,( '16:00', '22-06-02', 10, 30, 3, 2)
,('19:20', '22-06-02', 10, 20, 5, 15)
,('19:20', '22-06-02', 10, 20, 1, 15)
,( '19:20','22-06-02', 10, 30, 3, 15)
,('21:00', '22-06-02', 10, 20, 5, 12)
,('21:00', '22-06-02', 10, 20, 1, 12)
,('21:00', '22-06-02', 10, 30, 3, 12)
,('11:30', '22-06-02', 10, 20, 1, 5)
,('11:30', '22-06-02', 10, 30, 3, 5)
;
INSERT INTO showe (show_time, show_date, seats_remaining_pr, seats_remaining_nr, hall_id, movie_id)
VALUES ('11:30', '2022-06-04', 10, 0, 3, 5);

select * from showe;
select * from booking;


-- INSERT INTO booking (booking_time, boking_date, seat_class, card_number, name_on_card, show_id, user_id)
-- VALUES
CALL Booked_SEAT_BOOKING ( '09:30', '22-05-27', 'nr', '1231231521457894', 'Дубський Віталій Олегович', 1 , 11);
   CALL Booked_SEAT_BOOKING('09:30', '22-05-27', 'nr', '1231231521457894', 'Пипчак Олександр Андрійович', 7 , 14);
   CALL Booked_SEAT_BOOKING('09:30', '22-05-27', 'nr', '1231231521457894', 'Тихоступ Артур Віталійович', 5, 1);
   CALL Booked_SEAT_BOOKING('09:40', '22-05-27', 'pr', '1231231521457894', 'Струк Софія Романівна', 3, 17);
   CALL Booked_SEAT_BOOKING( '09:56', '22-05-27', 'nr', '1231231521457894', 'Федунь Вікторія Петрівна', 5, 6);
   CALL Booked_SEAT_BOOKING( '14:20', '22-05-28', 'pr', '1231231521457894', 'Лисий Назар Романович', 12 , 21);
   CALL Booked_SEAT_BOOKING('15:46', '22-05-29', 'nr', '1231231521457894', 'Саків Роман Артурович', 3, 15);

INSERT INTO booking (booking_time, boking_date, seat_class, card_number, name_on_card, show_id, user_id)
VALUES ( CURTIME(), CURRENT_DATE(), 'nr', '1231231521457894', 'Дубський Віталій Олегович', 1 , 11);

CALL Booked_SEAT_BOOKING('16:46', '22-05-26', 'nr', '1231231521457894', 'Саків Роман Артурович', 3, 15);

CALL Booked_SEAT_BOOKING('17:46', '22-05-29', 'nr', '1231231521457894', 'Саків Роман Артурович', 38, 16);

INSERT INTO showe (show_time, show_date, seats_remaining_pr, seats_remaining_nr, hall_id, movie_id)
VALUES ('11:30', '2022-06-04', 10, 0, 3, 5);

select * from showe;



 